In [3]:
import pandas as pd
import numpy as np

In [4]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1,NA,3.5,NA,7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                    ......:[NA,NA,NA],[NA,6.5,3.]])

In [12]:
cleaned = data.dropna()

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4] = NA

In [17]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
df = pd.DataFrame(np.random.randn(7,3))

In [20]:
df.iloc[:4,1] = NA

In [21]:
df.iloc[:2,2] = NA

In [22]:
df

          0         1         2
0  1.444656       NaN       NaN
1  0.323878       NaN       NaN
2 -0.035674       NaN -0.634864
3  1.397401       NaN  2.560686
4 -1.350442 -1.663695  0.455409
5  0.827417 -0.610127 -0.126132
6  0.259426  1.219984  1.970668

In [23]:
df.dropna()

          0         1         2
4 -1.350442 -1.663695  0.455409
5  0.827417 -0.610127 -0.126132
6  0.259426  1.219984  1.970668

In [24]:
df.dropna()

          0         1         2
4 -1.350442 -1.663695  0.455409
5  0.827417 -0.610127 -0.126132
6  0.259426  1.219984  1.970668

In [25]:
df.dropna(thresh=2)

          0         1         2
2 -0.035674       NaN -0.634864
3  1.397401       NaN  2.560686
4 -1.350442 -1.663695  0.455409
5  0.827417 -0.610127 -0.126132
6  0.259426  1.219984  1.970668

In [26]:
df.fillna(0)

          0         1         2
0  1.444656  0.000000  0.000000
1  0.323878  0.000000  0.000000
2 -0.035674  0.000000 -0.634864
3  1.397401  0.000000  2.560686
4 -1.350442 -1.663695  0.455409
5  0.827417 -0.610127 -0.126132
6  0.259426  1.219984  1.970668

In [27]:
df.fillna({1:0.5,2:0})

          0         1         2
0  1.444656  0.500000  0.000000
1  0.323878  0.500000  0.000000
2 -0.035674  0.500000 -0.634864
3  1.397401  0.500000  2.560686
4 -1.350442 -1.663695  0.455409
5  0.827417 -0.610127 -0.126132
6  0.259426  1.219984  1.970668

In [28]:
_ = df.fillna(0,inplace=True)

In [29]:
df

          0         1         2
0  1.444656  0.000000  0.000000
1  0.323878  0.000000  0.000000
2 -0.035674  0.000000 -0.634864
3  1.397401  0.000000  2.560686
4 -1.350442 -1.663695  0.455409
5  0.827417 -0.610127 -0.126132
6  0.259426  1.219984  1.970668

In [30]:
df = pd.DataFrame(np.random.randn(6,3))

In [31]:
df.iloc[2:,1] = NA

In [32]:
df.iloc[4:,2] = NA

In [33]:
df

          0         1         2
0 -0.677258 -0.550444 -1.011887
1 -0.015620  0.399945  0.793619
2 -0.720118       NaN  0.520802
3  0.418416       NaN  0.231162
4  0.271018       NaN       NaN
5  0.190786       NaN       NaN

In [34]:
df.fillna(method='ffill')

/run/user/1000/app/org.jupyter.JupyterLab/ipykernel_643/1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

          0         1         2
0 -0.677258 -0.550444 -1.011887
1 -0.015620  0.399945  0.793619
2 -0.720118  0.399945  0.520802
3  0.418416  0.399945  0.231162
4  0.271018  0.399945  0.231162
5  0.190786  0.399945  0.231162

In [35]:
df.fillna(method='ffill', limit=2)

/run/user/1000/app/org.jupyter.JupyterLab/ipykernel_643/2719175769.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.677258 -0.550444 -1.011887
1 -0.015620  0.399945  0.793619
2 -0.720118  0.399945  0.520802
3  0.418416  0.399945  0.231162
4  0.271018       NaN  0.231162
5  0.190786       NaN  0.231162

In [36]:
data = pd.Series([1.,NA,3.5,NA,7])

In [37]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [40]:
data = pd.DataFrame({'k1':['one','two'] * 3 + ['two'],
                          ......:'k2':[1,1,2,3,3,4,4]})

In [41]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [42]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [43]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [44]:
data['v1'] = range(7)

In [47]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [58]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [67]:
data = pd.DataFrame({'food': ['churrasco', 'coxinha', 'churrasco',
                    ....: 'Pastel', 'churrasco', 'churrasco',
                    ....: 'Pastel', 'p√£o de alho', 'salada'],
                    ....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [68]:
data

          food  ounces
0    churrasco     4.0
1      coxinha     3.0
2    churrasco    12.0
3       Pastel     6.0
4    churrasco     7.5
5    churrasco     8.0
6       Pastel     3.0
7  p√£o de alho     5.0
8       salada     6.0

In [69]:
meat_to_animal = {
'churrasco': 'batata doce',
'coxinha': 'batata doce',
'pizza': 'p√£o de alho',
'Bife de Frango': 'p√£o de alho',
'Chuleta': 'batata doce',
'Salada': 'salm√£o'
}

In [70]:
data

          food  ounces
0    churrasco     4.0
1      coxinha     3.0
2    churrasco    12.0
3       Pastel     6.0
4    churrasco     7.5
5    churrasco     8.0
6       Pastel     3.0
7  p√£o de alho     5.0
8       salada     6.0

In [71]:
lowercased = data['food'].str.lower()

In [72]:
lowercased

0      churrasco
1        coxinha
2      churrasco
3         pastel
4      churrasco
5      churrasco
6         pastel
7    p√£o de alho
8         salada
Name: food, dtype: object

In [73]:
data['animal'] = lowercased.map(meat_to_animal)

In [74]:
data

          food  ounces       animal
0    churrasco     4.0  batata doce
1      coxinha     3.0  batata doce
2    churrasco    12.0  batata doce
3       Pastel     6.0          NaN
4    churrasco     7.5  batata doce
5    churrasco     8.0  batata doce
6       Pastel     3.0          NaN
7  p√£o de alho     5.0          NaN
8       salada     6.0          NaN

In [78]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [79]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [80]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [81]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [82]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [83]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [84]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    ......:index=['Los Santos','San Fierro','Las Ventura'],
                    ......:columns=['one','two','three','four'])

In [87]:
transform = lambda x:x[:4].upper()

In [88]:
data.index.map(transform)

Index(['LOS ', 'SAN ', 'LAS '], dtype='object')

In [89]:
data

             one  two  three  four
Los Santos     0    1      2     3
San Fierro     4    5      6     7
Las Ventura    8    9     10    11

In [90]:
data.rename(index=str.title, columns=str.upper)

             ONE  TWO  THREE  FOUR
Los Santos     0    1      2     3
San Fierro     4    5      6     7
Las Ventura    8    9     10    11

In [91]:
data.rename(index={'LOS SANTOS': 'SAN FIERRO'},
           ......:columns={'three': 'peekaboo'})

             one  two  peekaboo  four
Los Santos     0    1         2     3
San Fierro     4    5         6     7
Las Ventura    8    9        10    11

In [92]:
data.rename(index={'LOS SANTOS': 'SAN FIERRO'}, inplace=True)

In [93]:
data

             one  two  three  four
Los Santos     0    1      2     3
San Fierro     4    5      6     7
Las Ventura    8    9     10    11

In [94]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [95]:
bins = [18,25,35,60,100]

In [96]:
cats = pd.cut(ages,bins)

In [97]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [98]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [99]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [101]:
pd.value_counts(cats)

/run/user/1000/app/org.jupyter.JupyterLab/ipykernel_643/1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [103]:
pd.cut(ages, [18,26,36,61,100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [106]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [107]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [108]:
data = np.random.rand(20)

In [109]:
pd.cut(data,4,precision=2)

[(0.24, 0.47], (0.0091, 0.24], (0.71, 0.94], (0.0091, 0.24], (0.0091, 0.24], ..., (0.24, 0.47], (0.71, 0.94], (0.71, 0.94], (0.71, 0.94], (0.47, 0.71]]
Length: 20
Categories (4, interval[float64, right]): [(0.0091, 0.24] < (0.24, 0.47] < (0.47, 0.71] < (0.71, 0.94]]

In [110]:
data = np.random.randn(1000) # Normalmente distribu√≠dos

In [111]:
cats = pd.qcut(data, 4) # Separa em quantis

In [112]:
cats

[(-0.0113, 0.754], (-2.9299999999999997, -0.625], (0.754, 2.932], (-0.0113, 0.754], (0.754, 2.932], ..., (-2.9299999999999997, -0.625], (-0.625, -0.0113], (0.754, 2.932], (0.754, 2.932], (-0.625, -0.0113]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.9299999999999997, -0.625] < (-0.625, -0.0113] < (-0.0113, 0.754] < (0.754, 2.932]]

In [113]:
pd.value_counts(cats)

/run/user/1000/app/org.jupyter.JupyterLab/ipykernel_643/1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(-2.9299999999999997, -0.625]    250
(-0.625, -0.0113]                250
(-0.0113, 0.754]                 250
(0.754, 2.932]                   250
Name: count, dtype: int64

In [114]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0113, 1.328], (-2.9299999999999997, -1.25], (1.328, 2.932], (-0.0113, 1.328], (-0.0113, 1.328], ..., (-1.25, -0.0113], (-1.25, -0.0113], (1.328, 2.932], (1.328, 2.932], (-1.25, -0.0113]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.9299999999999997, -1.25] < (-1.25, -0.0113] < (-0.0113, 1.328] < (1.328, 2.932]]

In [115]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [116]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.000070    -0.003942     0.015028     0.004071
std       0.980523     0.956060     1.023565     0.985732
min      -3.466844    -2.637881    -4.047740    -3.297706
25%      -0.616495    -0.682549    -0.713896    -0.647578
50%      -0.018891    -0.038327     0.021964    -0.010683
75%       0.669499     0.680661     0.730863     0.649947
max       3.049056     3.593932     3.380705     3.027744

In [117]:
col = data[2]

In [118]:
col[np.abs(col) > 3]

100   -3.134414
504   -4.047740
769    3.380705
932   -3.140182
Name: 2, dtype: float64

In [120]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [121]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.000724    -0.004633     0.015970     0.004634
std       0.978092     0.953693     1.017913     0.983773
min      -3.000000    -2.637881    -3.000000    -3.000000
25%      -0.616495    -0.682549    -0.713896    -0.647578
50%      -0.018891    -0.038327     0.021964    -0.010683
75%       0.669499     0.680661     0.730863     0.649947
max       3.000000     3.000000     3.000000     3.000000

In [122]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0  1.0
1 -1.0 -1.0  1.0  1.0
2 -1.0  1.0  1.0  1.0
3 -1.0  1.0  1.0  1.0
4 -1.0  1.0  1.0  1.0

In [123]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [124]:
sampler = np.random.permutation(5)

In [125]:
sampler

array([3, 4, 0, 2, 1])

In [126]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [127]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7

In [128]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11

In [129]:
choices = pd.Series([5, 7, -1, 6, 4])

In [130]:
draws = choices.sample(n=10, replace=True)

In [131]:
draws

3    6
1    7
3    6
0    5
2   -1
3    6
3    6
3    6
3    6
3    6
dtype: int64

In [132]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   .....: 'data1': range(6)})

In [133]:
pd.get_dummies(df['key'])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [134]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [135]:
df_with_dummy = df[['data1']].join(dummies)

In [136]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

In [137]:
mnames = ['movie_id', 'title', 'genres']